---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnlocked
source: html/928da6b1-e0f6-8dfe-45f8-f733f49add8d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnlocked Property

Dimension had to be un-EQed in order to remove sketch over-constraining.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionUnlocked { get; }
```